const updatehistory = [
    {
        tit: '2023_12_IV：',
        content: `
        1.Express伺服器初使主程序(包括前端設計)建立並運行
        <br>
        2.串接MONGODB完成，並且已建立用戶資料存儲結構
        <br>
        3.註冊與登入功能完成，並且可以透過信箱驗證後訪問登入後頁面
        <br>
        4.登出與倒數登出功能完成，清除該用戶Cookie
        <hr>`,
    },
    {
        tit: '2024_1_I：',
        content: `
        1.新增個人資料頁面與修改個資功能
        <br>
        2.上傳頭像功能已建立
        <br>
        3.修復繞過OTP驗證碼的漏洞
        <br>
        4.修復未登入狀態能取得登入後的資源漏洞
        <br>
        5.構建登入後聊天室頁面(包括前端設計)
        <br>
        6.引進Session功能保存各用戶在網站上占存的活動紀錄
        <hr>`,
    },
    {
        tit: '2024_1_II：',
        content: `
        1.構建MONGODB聊天資料存儲結構並串接
        <br>
        2.完成好友搜尋好友功能(分為三狀態:已是好友、申請中、未加好友)
        <br>
        3.完成好友申請接受與拒絕的功能
        <br>
        4.完成好友列表刪除的功能
        <br>
        5.完成好友列表前往聊天頁面的功能且顯示聊天紀錄的清單
        <br>
        6.引進SocketIO功能使所有聊天操作為即時的
        <br>
        7.完成即時聊天頁面對話功能(包括前端設計頁面)
        <hr>`,
    },
    {
        tit: '2024_1_III：',
        content: `
        1.更新刪除好友時聊天紀錄會清除聊天紀錄
        <br>
        2.筆記與歷程前端頁面建立
        <br>
        3.構建MONGODB聯絡資料存儲結構並串接
        <br>
        4.用戶的聯絡功能完成(包括前端設計)，並且可以查看管理員回復狀態
        <hr>`,
    },
    {
        tit: '2024_1_IV：',
        content: `
        1.改用HTTPS連線，新增SSL憑證，使用戶資料更安全
        <br>
        2.
        <hr>`,
    }
]